## test excel report export creator

In [1]:
import pandas as pd

In [3]:
# df = pd.read_excel("test_data.xlsx", sheetname="PunchTime")
df = pd.read_csv("test.csv")
df

,id,staff_id,first_name,last_name,branch_name,task_name,punch_time_in,punch_time_out,session_time_hours
0,1112016-01-02 08:00:00,9997,TEST_FIRST_NAME_1,TEST_LAST_NAME_1,TEST_BRANCH_1,TEST_TASK_1,2016-01-02 08:00:00,2016-01-02 11:00:00,3.0
1,1232016-01-03 11:00:00,9997,TEST_FIRST_NAME_1,TEST_LAST_NAME_1,TEST_BRANCH_2,TEST_TASK_3,2016-01-03 11:00:00,2016-01-03 12:00:00,1.0
2,2122016-01-03 10:00:00,9998,TEST_FIRST_NAME_2,TEST_LAST_NAME_2,TEST_BRANCH_1,TEST_TASK_2,2016-01-03 10:00:00,2016-01-03 12:00:00,2.0
3,3112016-01-04 09:00:00,9999,TEST_FIRST_NAME_3,TEST_LAST_NAME_3,TEST_BRANCH_1,TEST_TASK_1,2016-01-04 09:00:00,NaN,NaN

In [5]:
df['volunteer_name'] = df.last_name + ", " + df.first_name
df

,id,staff_id,first_name,last_name,branch_name,task_name,punch_time_in,punch_time_out,session_time_hours,volunteer_name
0,1112016-01-02 08:00:00,9997,TEST_FIRST_NAME_1,TEST_LAST_NAME_1,TEST_BRANCH_1,TEST_TASK_1,2016-01-02 08:00:00,2016-01-02 11:00:00,3.0,"TEST_LAST_NAME_1, TEST_FIRST_NAME_1"
1,1232016-01-03 11:00:00,9997,TEST_FIRST_NAME_1,TEST_LAST_NAME_1,TEST_BRANCH_2,TEST_TASK_3,2016-01-03 11:00:00,2016-01-03 12:00:00,1.0,"TEST_LAST_NAME_1, TEST_FIRST_NAME_1"
2,2122016-01-03 10:00:00,9998,TEST_FIRST_NAME_2,TEST_LAST_NAME_2,TEST_BRANCH_1,TEST_TASK_2,2016-01-03 10:00:00,2016-01-03 12:00:00,2.0,"TEST_LAST_NAME_2, TEST_FIRST_NAME_2"
3,3112016-01-04 09:00:00,9999,TEST_FIRST_NAME_3,TEST_LAST_NAME_3,TEST_BRANCH_1,TEST_TASK_1,2016-01-04 09:00:00,NaN,NaN,"TEST_LAST_NAME_3, TEST_FIRST_NAME_3"